<?php
// Тут я створюю змінні, які відповідають початку ренджу і кінцю ренджу
$start = 10;
$end = 19;

// Створюю масив з-за допомоги функції range()
$array = range($start, $end);
echo "Масив після створення:\n";

// Виводжу масив у зручному для читання форматі
print_r($array);

// Тут з-за допомоги функції unset() видаляю масив
unset($array);

// Тут з-за допомоги функції isSet() перевіряю чи масив такий існує, якщо так, то виводжу його, якщо ні, то видаляю
echo "Масив після видалення:\n";
if (isset($array))
    print_r($array);
else
    echo "Масив був успішно видалений!"
?>