<?php
// описуємо функцію, яка відповідатиме за перевірку масиву чи він є арифметичною прогресією
function isArithmeticProgression($array)
{
    // якщо довжина масиву менша два, то він не може бути арифметичною прогресією
    $n = count($array);
    if ($n < 2)
        return false;
    // створюємо змінну $difference, в яку записуємо різницю перших двох елементів
    $difference = $array[1] - $array[0];
    // ітеруємось по масиву, якщо різниця наступних елементів не дорівнює різниці перших двох - масив не є арифметичною прогресією
    for ($i = 2; $i < $n; $i++) {
        if ($array[$i] - $array[$i - 1] != $difference)
            return false;
    }

    return true;
}
// описуємо функцію, яка підраховуватиме кількість рядків (масивів) у матриці, які є арифметичною прогресією
function countArithmeticProgressionRows($matrix)
{
    // створюємо лічильник
    $count = 0;
    // ітеруємось, перевіряємо чи масив є арифметичною прогресією, якщо так, тоді збільшуємо лічильник на одиничку
    foreach ($matrix as $row) {
        if (isArithmeticProgression($row))
            $count++;
    }
    return $count;
}

$matrix = [
    [1, 4, 7],
    [2, 4, 8],
    [3, 6, 9],
    [5, 10, 15]
];

echo "Кількість рядків у матриці, які утворюють арифметичну прогресією: " .countArithmeticProgressionRows($matrix);
?>


